export default function Cock(){
    return <div className="pt-[300px] p-[20px] text-[20px]">
<p>Добрый день потенциальный работодатель. Не люблю растекаться мыслью по древу, и поэтому кратко расскажу тебе свою 
    биографию.
</p>
<p>Родился я в 1987 году от рождества Христова в Литовской ССР, которая была тогда частью СССР, по крайней мере фактически
    . С чисто юридической точки зрения ситуайия конечно же несколько сложней, так как западные страны к примеру 
    не призналь прибалтику частью СССР, хотя согдасно Атлантической хартии она и входила в чферу влияния СССР.
</p>
<p>Ну чтож, здесь я думаю уместно будет процитировать Шекспира, клятвы данные в бурю забываються в тихую погоду. 
    Примерно так же дело обстояло и с проливами на словах столь щедро обещанными царской россии, ну довольно об этом,
    теперь пожалуй перейдем к моему детству.
</p>
<p>Детство мое прошло в городе Тейково Ивановской области. Было у меня в доме две кошки, одна позднее умерла при родах,
    а другая прожила больше десяти лет, и умерла от старости,и кот. Также была собака, смесь немецкой и кавказской овчарки. 
    То есть папа был кавказец, а мама немецкая овчарка. Звали его Рекс.
</p>
<p>Также были гуси, куры, свиньи, и один раз даже быка держали. Также был огород. На огороде том росло много 
    смородины, две яблони, и крыжовник.
</p>
    </div>
}