export interface S{
    id:string,
    name:string,
    interesting:string,
    interesting2:string,
    difficulties:string,
    difficulties2:string
     problems:string,
     problems2:string,
     learned:string,
     learned2:string,
       image:string,
       github:string,
       site:string
}
export const data:S[]=[
    {id:"01",name:"Сайт-портфолио дизайнеру",
    interesting:"Чем интересен проект:",
    interesting2:
    "Я взялся за этот проект, \
    тк мне было интересно поработать с реальным заказчиком-дизайнером и \
    реализовать изученные до этого навыки.",
    difficulties:"Сложности: ",
    difficulties2:'Заказчик хотел чтобы можно было прокручивать изображения при просмотре,а я на тот момент не знал как это делать.',
     problems:'Решение проблем: ',
     problems2:'Решил задачу освоив Swiper и выполнив требования заказчика используя эту библиотеку.',
     learned:'Этот проект научил меня:',
     learned2:'Порой не стоит изобретать велосипед. Для многих проблем существует набор готовых решений\
     и нужно просто научиться использовать их!',
       image:"/MA.png",
       github:"https://github.com/sergioignatev/for-efrem",
       site:'https://sergioignatiev.github.io/for-efrem/#/'

},
{id:"02",name:"Список покупок",
interesting:"Чем интересен проект: ",
interesting2:
"Делал этот проект в рамках обучения\
и для личного пользования,и для друзей. Простое приложение позволяет не забыть что нужно купить.",
difficulties:"Сложности: ",
difficulties2:'В процессе работы я столкнулся с тем,\
 что .... . В том числе понял, что нужно подтянуть навыки ... и сделал это в дальнейшем',
 problems:'Решение проблем: ',
 problems2:'Описание того как я самоотверженно решал проблемы блока Сложности',
 learned:'Этот проект научил меня:',
 learned2:'Связываться с дизайнерами себе дороже.\
  Поработаю-ка я в обычной компании. \
  А то заебли со своими пиксель вправо, пиксель влево,\
   а у самих даже слои нормально не названы!',
   image:"/grocery.png",
   github:"https://github.com/sergioignatev/Grocery",
   site:'https://sergioignatiev.github.io/Grocery/'

},
{id:"03",name:"NevaTrip",
interesting:"Чем интересен проект: ",
interesting2:
"Я взялся за этот проект, \
тк мне было интересно поработать с реальным заказчиком-дизайнером и \
реализовать изученные до этого навыки. Особое внимание я уделял",
difficulties:"Сложности: ",
difficulties2:'В процессе работы я столкнулся с тем,\
 что .... . В том числе понял, что нужно подтянуть навыки ... и сделал это в дальнейшем',
 problems:'Решение проблем: ',
 problems2:'Описание того как я самоотверженно решал проблемы блока Сложности',
 learned:'Этот проект научил меня:',
 learned2:'Связываться с дизайнерами себе дороже.\
  Поработаю-ка я в обычной компании. \
  А то заебли со своими пиксель вправо, пиксель влево,\
   а у самих даже слои нормально не названы!',
   image:"/nevatrip.png",
   github:"https://github.com/sergioignatev/nevatrip",
   site:'https://sergioignatiev.github.io/nevatrip/'

},
{id:"04",name:"Велосипеды",
interesting:"Чем интересен проект: ",
interesting2:
"Я взялся за этот проект, \
тк мне было интересно поработать с реальным заказчиком-дизайнером и \
реализовать изученные до этого навыки. Особое внимание я уделял",
difficulties:"Сложности: ",
difficulties2:'В процессе работы я столкнулся с тем,\
 что .... . В том числе понял, что нужно подтянуть навыки ... и сделал это в дальнейшем',
 problems:'Решение проблем: ',
 problems2:'Описание того как я самоотверженно решал проблемы блока Сложности',
 learned:'Этот проект научил меня:',
 learned2:'Связываться с дизайнерами себе дороже.\
  Поработаю-ка я в обычной компании. \
  А то заебли со своими пиксель вправо, пиксель влево,\
   а у самих даже слои нормально не названы!',
   image:"/bike.png",
   github:"https://github.com/sergioignatev/bycicle",
   site:'https://sergioignatiev.github.io/bycicle/'

},
{id:"05",name:"Pipernet",
interesting:"Чем интересен проект: ",
interesting2:
"Я взялся за этот проект, \
тк мне было интересно поработать с реальным заказчиком-дизайнером и \
реализовать изученные до этого навыки. Особое внимание я уделял",
difficulties:"Сложности: ",
difficulties2:'В процессе работы я столкнулся с тем,\
 что .... . В том числе понял, что нужно подтянуть навыки ... и сделал это в дальнейшем',
 problems:'Решение проблем: ',
 problems2:'Описание того как я самоотверженно решал проблемы блока Сложности with the help of my cock and other lorem ipsum devices',
 learned:'Этот проект научил меня:',
 learned2:'Связываться с дизайнерами себе дороже.\
  Поработаю-ка я в обычной компании. \
  А то заебли со своими пиксель вправо, пиксель влево,\
   а у самих даже слои нормально не названы!',
   image:"/pipernet.png",
   github:"https://github.com/sergioignatev/pipernet",
   site:'https://sergioignatiev.github.io/pipernet/'

}



]