export interface S{
    id:string,
    name:string,
    interesting:string,
    interesting2:string,
    difficulties:string,
    difficulties2:string
     problems:string,
     problems2:string,
     learned:string,
     learned2:string,
       image:string,
       github:string,
       site:string
}
export const data:S[]=[
    {id:"01",name:"Сайт-портфолио дизайнеру",
    interesting:"Чем интересен проект: ",
    interesting2:
    "Я взялся за этот проект, \
    тк мне было интересно поработать с реальным заказчиком-дизайнером и \
    реализовать изученные до этого навыки. Особое внимание я уделял",
    difficulties:"Сложности: ",
    difficulties2:'В процессе работы я столкнулся с тем,\
     что .... . В том числе понял, что нужно подтянуть навыки ... и сделал это в дальнейшем',
     problems:'Решение проблем: ',
     problems2:'Описание того как я самоотверженно решал проблемы блока Сложности',
     learned:'Этот проект научил меня:',
     learned2:'Связываться с дизайнерами себе дороже.\
      Поработаю-ка я в обычной компании. \
      А то заебли со своими пиксель вправо, пиксель влево,\
       а у самих даже слои нормально не названы!',
       image:"/main2.jpg",
       github:"",
       site:''

},
{id:"02",name:"Сайт-портфолио дизайнеру",
interesting:"Чем интересен проект: ",
interesting2:
"Я взялся за этот проект, \
тк мне было интересно поработать с реальным заказчиком-дизайнером и \
реализовать изученные до этого навыки. Особое внимание я уделял",
difficulties:"Сложности: ",
difficulties2:'В процессе работы я столкнулся с тем,\
 что .... . В том числе понял, что нужно подтянуть навыки ... и сделал это в дальнейшем',
 problems:'Решение проблем: ',
 problems2:'Описание того как я самоотверженно решал проблемы блока Сложности',
 learned:'Этот проект научил меня:',
 learned2:'Связываться с дизайнерами себе дороже.\
  Поработаю-ка я в обычной компании. \
  А то заебли со своими пиксель вправо, пиксель влево,\
   а у самих даже слои нормально не названы!',
   image:"/main2.jpg",
   github:"",
   site:''

},
{id:"03",name:"Work5",
interesting:"Чем интересен проект: ",
interesting2:
"Я взялся за этот проект, \
тк мне было интересно поработать с реальным заказчиком-дизайнером и \
реализовать изученные до этого навыки. Особое внимание я уделял",
difficulties:"Сложности: ",
difficulties2:'В процессе работы я столкнулся с тем,\
 что .... . В том числе понял, что нужно подтянуть навыки ... и сделал это в дальнейшем',
 problems:'Решение проблем: ',
 problems2:'Описание того как я самоотверженно решал проблемы блока Сложности',
 learned:'Этот проект научил меня:',
 learned2:'Связываться с дизайнерами себе дороже.\
  Поработаю-ка я в обычной компании. \
  А то заебли со своими пиксель вправо, пиксель влево,\
   а у самих даже слои нормально не названы!',
   image:"/main2.jpg",
   github:"",
   site:''

},
{id:"04",name:"Велосипеды",
interesting:"Чем интересен проект: ",
interesting2:
"Я взялся за этот проект, \
тк мне было интересно поработать с реальным заказчиком-дизайнером и \
реализовать изученные до этого навыки. Особое внимание я уделял",
difficulties:"Сложности: ",
difficulties2:'В процессе работы я столкнулся с тем,\
 что .... . В том числе понял, что нужно подтянуть навыки ... и сделал это в дальнейшем',
 problems:'Решение проблем: ',
 problems2:'Описание того как я самоотверженно решал проблемы блока Сложности',
 learned:'Этот проект научил меня:',
 learned2:'Связываться с дизайнерами себе дороже.\
  Поработаю-ка я в обычной компании. \
  А то заебли со своими пиксель вправо, пиксель влево,\
   а у самих даже слои нормально не названы!',
   image:"/isabella.jpg",
   github:"",
   site:''

}



]